; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	spectrograph2 - mode
	infrared1 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star12 - direction
	Star9 - direction
	Star8 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation11 - direction
	GroundStation13 - direction
	GroundStation10 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Star14 - direction
	Star5 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation11)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation13)
	(calibration_target instrument4 GroundStation11)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star14)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 GroundStation10)
	(supports instrument6 spectrograph2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star16)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Star1)
	(have_image Planet15 spectrograph2)
	(have_image Star16 thermograph0)
	(have_image Phenomenon17 thermograph0)
))

)

; plan
1. (turn_to satellite1 star1 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star1)
   goals met: 1 of 5
2. (turn_to satellite0 groundstation2 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 5
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
4. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 5
5. (turn_to satellite0 phenomenon17 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 5
6. (take_image satellite0 phenomenon17 instrument0 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 2 of 5
7. (turn_to satellite0 planet15 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet15)
   goals met: 2 of 5
8. (take_image satellite0 planet15 instrument0 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 3 of 5
9. (turn_to satellite0 star16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star16)
   goals met: 3 of 5
10. (take_image satellite0 star16 instrument0 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 4 of 5
11. (turn_to satellite0 groundstation0 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation0)
   goals met: 5 of 5
